In [48]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [49]:
df=pd.read_csv("C:\\Users\\kapur\\Downloads\\hr_analytics.csv")
df

,Employee_ID,Gender,Age,Marital_Status,City,Department,Job_Role,Education,Experience_Years,Employment_Type,Joining_Date,Last_Working_Date,Tenure_Years,Salary,Performance_Rating,Performance_Improvement_Plan,Num_Trainings,Leave_Count,Manager_ID,Attrition
0,E100001,Female,34,Married,Delhi,HR,HR Executive,Bachelors,7.9,Full-time,2009-12-13,NaN,15.87,50390,4,No,0,5,E101792,No
1,E100002,Male,29,Single,Mumbai,Customer Support,Support Agent,Bachelors,6.6,Full-time,2023-09-24,NaN,2.09,39346,3,No,1,5,E102708,No
2,E100003,Male,28,Married,Bengaluru,Customer Support,Support Agent,Bachelors,6.0,Full-time,2011-06-27,NaN,14.34,50237,3,No,0,6,E100800,No
3,E100004,Male,28,Married,Pune,Finance,Accountant,Bachelors,8.0,Full-time,2024-05-13,NaN,1.46,48946,2,No,0,7,E100058,No
4,E100005,Male,36,Married,Hyderabad,R&D,Product Analyst,MBA,10.3,Full-time,2016-02-10,NaN,9.71,56137,3,No,1,6,E104134,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,E104996,Female,36,Single,Chennai,HR,HR Manager,Masters,13.2,Full-time,2023-09-14,2024-11-08,1.15,65729,3,No,1,9,E104884,Yes
4996,E104997,Male,27,Single,Delhi,Marketing,Brand Manager,Bachelors,2.3,Full-time,2023-02-08,2025-06-11,2.34,40392,3,No,3,7,E101658,Yes
4997,E104998,Female,27,Married,Bengaluru,R&D,Research Analyst,Masters,4.0,Contract,2022-08-18,NaN,3.20,44557,3,No,1,3,E104748,No
4998,E104999,Male,28,Married,Mumbai,Finance,Accountant,Bachelors,5.7,Contract,2018-08-25,NaN,7.18,48768,3,No,4,13,E104848,No
4999,E105000,Female,37,Single,Pune,HR,HR Executive,MBA,6.2,Full-time,2015-08-01,NaN,10.24,43315,2,No,0,1,E100719,No

In [50]:
df.head()

,Employee_ID,Gender,Age,Marital_Status,City,Department,Job_Role,Education,Experience_Years,Employment_Type,Joining_Date,Last_Working_Date,Tenure_Years,Salary,Performance_Rating,Performance_Improvement_Plan,Num_Trainings,Leave_Count,Manager_ID,Attrition
0,E100001,Female,34,Married,Delhi,HR,HR Executive,Bachelors,7.9,Full-time,2009-12-13,NaN,15.87,50390,4,No,0,5,E101792,No
1,E100002,Male,29,Single,Mumbai,Customer Support,Support Agent,Bachelors,6.6,Full-time,2023-09-24,NaN,2.09,39346,3,No,1,5,E102708,No
2,E100003,Male,28,Married,Bengaluru,Customer Support,Support Agent,Bachelors,6.0,Full-time,2011-06-27,NaN,14.34,50237,3,No,0,6,E100800,No
3,E100004,Male,28,Married,Pune,Finance,Accountant,Bachelors,8.0,Full-time,2024-05-13,NaN,1.46,48946,2,No,0,7,E100058,No
4,E100005,Male,36,Married,Hyderabad,R&D,Product Analyst,MBA,10.3,Full-time,2016-02-10,NaN,9.71,56137,3,No,1,6,E104134,No

In [51]:
df.tail()

,Employee_ID,Gender,Age,Marital_Status,City,Department,Job_Role,Education,Experience_Years,Employment_Type,Joining_Date,Last_Working_Date,Tenure_Years,Salary,Performance_Rating,Performance_Improvement_Plan,Num_Trainings,Leave_Count,Manager_ID,Attrition
4995,E104996,Female,36,Single,Chennai,HR,HR Manager,Masters,13.2,Full-time,2023-09-14,2024-11-08,1.15,65729,3,No,1,9,E104884,Yes
4996,E104997,Male,27,Single,Delhi,Marketing,Brand Manager,Bachelors,2.3,Full-time,2023-02-08,2025-06-11,2.34,40392,3,No,3,7,E101658,Yes
4997,E104998,Female,27,Married,Bengaluru,R&D,Research Analyst,Masters,4.0,Contract,2022-08-18,NaN,3.20,44557,3,No,1,3,E104748,No
4998,E104999,Male,28,Married,Mumbai,Finance,Accountant,Bachelors,5.7,Contract,2018-08-25,NaN,7.18,48768,3,No,4,13,E104848,No
4999,E105000,Female,37,Single,Pune,HR,HR Executive,MBA,6.2,Full-time,2015-08-01,NaN,10.24,43315,2,No,0,1,E100719,No

In [52]:
df.shape

(5000, 20)

In [53]:
df.columns

Index(['Employee_ID', 'Gender', 'Age', 'Marital_Status', 'City', 'Department',
       'Job_Role', 'Education', 'Experience_Years', 'Employment_Type',
       'Joining_Date', 'Last_Working_Date', 'Tenure_Years', 'Salary',
       'Performance_Rating', 'Performance_Improvement_Plan', 'Num_Trainings',
       'Leave_Count', 'Manager_ID', 'Attrition'],
      dtype='object')

In [54]:
df.dtypes

Employee_ID                      object
Gender                           object
Age                               int64
Marital_Status                   object
City                             object
Department                       object
Job_Role                         object
Education                        object
Experience_Years                float64
Employment_Type                  object
Joining_Date                     object
Last_Working_Date                object
Tenure_Years                    float64
Salary                            int64
Performance_Rating                int64
Performance_Improvement_Plan     object
Num_Trainings                     int64
Leave_Count                       int64
Manager_ID                       object
Attrition                        object
dtype: object

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 20 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Employee_ID                   5000 non-null   object
 1   Gender                        5000 non-null   object
 2   Age                           5000 non-null   int64
 3   Marital_Status                5000 non-null   object
 4   City                          5000 non-null   object
 5   Department                    5000 non-null   object
 6   Job_Role                      5000 non-null   object
 7   Education                     5000 non-null   object
 8   Experience_Years              5000 non-null   float64
 9   Employment_Type               5000 non-null   object
 10  Joining_Date                  5000 non-null   object
 11  Last_Working_Date             767 non-null    object
 12  Tenure_Years                  5000 non-null   float64
 13  Salary                        5000 non-null   int64
 14  Performance_Rating            5000 non-null   int64
 15  Performance_Improvement_Plan  5000 non-null   object
 16  Num_Trainings                 5000 non-null   int64
 17  Leave_Count                   5000 non-null   int64
 18  Manager_ID                    4600 non-null   object
 19  Attrition                     5000 non-null   object
dtypes: float64(2), int64(5), object(13)
memory usage: 781.4+ KB

In [56]:
df.describe()

,Age,Experience_Years,Tenure_Years,Salary,Performance_Rating,Num_Trainings,Leave_Count
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000
mean,31.551200,6.903800,8.250264,46287.539800,3.007200,1.812000,5.988000
std,5.857187,4.676553,5.206016,10466.697593,0.934303,1.355073,2.443491
min,21.000000,0.000000,0.040000,21284.000000,1.000000,0.000000,0.000000
25%,27.000000,3.300000,3.610000,38790.000000,2.000000,1.000000,4.000000
50%,31.000000,6.200000,7.905000,45160.500000,3.000000,2.000000,6.000000
75%,36.000000,9.700000,12.710000,52587.750000,4.000000,3.000000,8.000000
max,54.000000,26.500000,17.820000,92522.000000,5.000000,9.000000,16.000000

In [57]:
df.isnull().sum()

Employee_ID                        0
Gender                             0
Age                                0
Marital_Status                     0
City                               0
Department                         0
Job_Role                           0
Education                          0
Experience_Years                   0
Employment_Type                    0
Joining_Date                       0
Last_Working_Date               4233
Tenure_Years                       0
Salary                             0
Performance_Rating                 0
Performance_Improvement_Plan       0
Num_Trainings                      0
Leave_Count                        0
Manager_ID                       400
Attrition                          0
dtype: int64

In [58]:
df["Manager_ID"]=df["Manager_ID"].fillna("Self")

In [59]:
df["Manager_ID"].isnull().sum()

np.int64(0)

In [60]:
df.duplicated().sum()

np.int64(0)

In [61]:
df.rename(columns={"Num_Trainings":"Total_Trainings"},inplace=True)

In [62]:
df["Joining_Date"]=pd.to_datetime(df["Joining_Date"])

In [63]:
df["Tenure_Years"]=df["Tenure_Years"].round()

In [64]:
df["Last_Working_Date"]=pd.to_datetime(df["Last_Working_Date"])

In [67]:
df["Last_Working_Date"]=df["Last_Working_Date"].fillna(value='Active')

In [68]:
df["Last_Working_Date"].isnull().sum()

np.int64(0)

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 20 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   Employee_ID                   5000 non-null   object
 1   Gender                        5000 non-null   object
 2   Age                           5000 non-null   int64
 3   Marital_Status                5000 non-null   object
 4   City                          5000 non-null   object
 5   Department                    5000 non-null   object
 6   Job_Role                      5000 non-null   object
 7   Education                     5000 non-null   object
 8   Experience_Years              5000 non-null   float64
 9   Employment_Type               5000 non-null   object
 10  Joining_Date                  5000 non-null   datetime64[ns]
 11  Last_Working_Date             5000 non-null   object
 12  Tenure_Years                  5000 non-null   float64
 13  Salary                        5000 non-null   int64
 14  Performance_Rating            5000 non-null   int64
 15  Performance_Improvement_Plan  5000 non-null   object
 16  Total_Trainings               5000 non-null   int64
 17  Leave_Count                   5000 non-null   int64
 18  Manager_ID                    5000 non-null   object
 19  Attrition                     5000 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(5), object(12)
memory usage: 781.4+ KB

# Feature Engineering -

In [70]:
def age_category(age):
    if age>=20 and age<=30:
        return 'Young'
    elif age>30 and age<=40:
        return 'Adult'
    else:
        return 'Senior'
df["Age_Group"]=df["Age"].apply(age_category)

In [71]:
def experience_level(years):
    if years==0 and years<=2:
        return 'Junior'
    elif years>2 and years<=5:
        return 'Mid_Level'
    elif years>5 and years<=10:
        return 'Senior'
    else:
        return 'Expert'
df["Experience_Level"]=df["Experience_Years"].apply(experience_level)

In [72]:
df

,Employee_ID,Gender,Age,Marital_Status,City,Department,Job_Role,Education,Experience_Years,Employment_Type,...,Tenure_Years,Salary,Performance_Rating,Performance_Improvement_Plan,Total_Trainings,Leave_Count,Manager_ID,Attrition,Age_Group,Experience_Level
0,E100001,Female,34,Married,Delhi,HR,HR Executive,Bachelors,7.9,Full-time,...,16.0,50390,4,No,0,5,E101792,No,Adult,Senior
1,E100002,Male,29,Single,Mumbai,Customer Support,Support Agent,Bachelors,6.6,Full-time,...,2.0,39346,3,No,1,5,E102708,No,Young,Senior
2,E100003,Male,28,Married,Bengaluru,Customer Support,Support Agent,Bachelors,6.0,Full-time,...,14.0,50237,3,No,0,6,E100800,No,Young,Senior
3,E100004,Male,28,Married,Pune,Finance,Accountant,Bachelors,8.0,Full-time,...,1.0,48946,2,No,0,7,E100058,No,Young,Senior
4,E100005,Male,36,Married,Hyderabad,R&D,Product Analyst,MBA,10.3,Full-time,...,10.0,56137,3,No,1,6,E104134,No,Adult,Expert
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,E104996,Female,36,Single,Chennai,HR,HR Manager,Masters,13.2,Full-time,...,1.0,65729,3,No,1,9,E104884,Yes,Adult,Expert
4996,E104997,Male,27,Single,Delhi,Marketing,Brand Manager,Bachelors,2.3,Full-time,...,2.0,40392,3,No,3,7,E101658,Yes,Young,Mid_Level
4997,E104998,Female,27,Married,Bengaluru,R&D,Research Analyst,Masters,4.0,Contract,...,3.0,44557,3,No,1,3,E104748,No,Young,Mid_Level
4998,E104999,Male,28,Married,Mumbai,Finance,Accountant,Bachelors,5.7,Contract,...,7.0,48768,3,No,4,13,E104848,No,Young,Senior
4999,E105000,Female,37,Single,Pune,HR,HR Executive,MBA,6.2,Full-time,...,10.0,43315,2,No,0,1,E100719,No,Adult,Senior

In [74]:
df.to_csv("df_cleaned.csv",index=False)